INITIAL_TEXT = ('Приветствую!\nМеня зовут Вимп. Я бот-помощник.\nЧто я умею?\nПока не много.\n\n'
                'Для просмотра Ключевых правил безопасности отправьте /pravila\n\n'
                'Для просмотра листов "ВНИМАНИЕ" за текущий год отправьте /vnimanie\n\n'
                'В любой трудной ситуации отправь /help\n\n'
                'Для просмотра информации о технической учёбе отправьте /tu\n\n'
                'Для просмотра информации о ПАТ отправьте /pat\n\n')

FINAL_TEXT = '/help\n/pravila\n/vnimanie\n/pat\n/tu\n/vopros'

KPB_TEXT = 'Это ключевые правила безопасности.\nСоблюдение этих правил позволит сохранить твоё здоровье.\nТрудись безопасно!'

HELP_TEXT = ' ты можешь не верить в себя, но знай и помни, что я верю в тебя. Я всегда верил и буду верить. У тебя всё получится!'

NS_TEXT = 'Это информация о несчастных случаях на производстве.'

SERVICE_END_TEXT = ('Итак, что там за обновление...\n'
             'Теперь вы сможете пообщатся со мной индивидуально.\n'
             'Переходите сюда @gks56_bot и напишите мне /start\n'
             'Наше с вами общение никто не увидит.\n'
             'Но можете написать мне и в нашей группе. Для этого наберите "@" и выберите меня в списке участников группы, а затем наберите /start\n'
             'А в остальном я всё тот же зануда. Всего хорошего!')

SERVICE_TEXT = 'Я отключусь пока, получаю обновление. Если к утру меня не будет, то вы знаете кто виноват.'
