INITIAL_TEXT = ('Приветствую!\nМеня зовут Вимп. Я бот-помощник.\nЧто я умею?\n\n'
                'Для просмотра Ключевых правил безопасности отправь /pravila\n\n'
                'Для просмотра листов "ВНИМАНИЕ" за текущий год отправь /vnimanie\n\n'
                'В любой трудной ситуации отправь /help\n\n'
                'Для просмотра информации о технической учёбе отправь /tu\n\n'
                'Для просмотра информации о ПАТ отправь /pat\n\n'
                'Для тестирования знаний отправь /vopros')

FINAL_TEXT = '/help\n/pravila\n/vnimanie\n/pat\n/tu\n/vopros'

KPB_TEXT = 'Это ключевые правила безопасности.\nСоблюдение этих правил позволит сохранить твоё здоровье.\nТрудись безопасно!'

HELP_TEXT = ' ты можешь не верить в себя, но знай и помни, что я верю в тебя. Я всегда верил и буду верить. У тебя всё получится!'

NS_TEXT = 'Это информация о несчастных случаях на производстве.'

QUIZ_TEXT = 'Ещё вопрос: /vopros\n\nПоказать все команды: /menu'

SERVICE_END_TEXT = ('Я получил обновление...\n\n'
             'Пополнение базы тестовых вопросов. Было 65, стало 94.'
             'Добавлены вопросы из тестов для сменных инженеров от комиссии.\n'
             'Тот кто часто пользуется моими тестами мог заметить, что я иногда '
             'не присылаю ответ на запрос теста. Это связано с ограничениями Телеграма. '
             'Среди ботов поговаривают, что Дуров лично проверяет чтобы в вариантах ответов '
             'не было больше 100 символов.\n'
             'Большое обновление, связанное с возможностью делать заявку на спец.технику.'
             'Эта функциональность будет доступна для группы ГКС, в которую я буду скоро внедряться.'
             'Пожелайте мне удачи.\n\n'
             'А в остальном я всё тот же зануда. Всего хорошего!')

SERVICE_TEXT = 'Я отключусь пока, получаю обновление. Если к утру меня не будет, то вы знаете кто виноват.'
