INITIAL_TEXT = ('Приветствую!\nМеня зовут Вимп. Я бот-помощник.\nЧто я умею?\nПока не много.\n\n'
                'Для просмотра Ключевых правил безопасности отправьте /pravila\n\n'
                'Для просмотра листов "ВНИМАНИЕ" за текущий год отправьте /vnimanie\n\n'
                'В любой трудной ситуации отправь /help')

FINAL_TEXT = '/help\n/pravila\n/vnimanie'

# HELP_TEXT = ('Для обзора моих возможностей отправьте /help\n\n'
#              'Для просмотра Ключевых правил безопасности отправьте /pravila\n\n'
#              'Для просмотра листов "ВНИМАНИЕ" за текущий год отправьте /vnimanie\n\n'
#              'В любой не понятной ситуации отправь /start')

KPB_TEXT = 'Это ключевые правила безопасности.\nСоблюдение этих правил позволит сохранить твоё здоровье.\nТрудись безопасно!'

HELP_TEXT = ' ты можешь не верить в себя, но знай и помни, что я верю в тебя. Я всегда верил и буду верить. У тебя всё получится!'

NS_TEXT = 'Это информация о несчастных случаях на производстве.'
