INITIAL_TEXT = (
    'Приветствую!\nМеня зовут Вимп. Я бот-помощник.\nЧто я умею:\n\n'
    'Для просмотра Ключевых правил безопасности отправь /pravila\n\n'
    'Для просмотра листов "ВНИМАНИЕ" за текущий год отправь /vnimanie\n\n'
    'В любой трудной ситуации отправь /help\n\n'
    'Для просмотра информации о технической учёбе отправь /tu\n\n'
    'Для просмотра информации о ПАТ отправь /pat\n\n'
    'Для тестирования знаний отправь /vopros\n\n'
    'Для отзыва и предложений отправь /offer'
)

FINAL_TEXT = '/help\n/pravila\n/vnimanie\n/pat\n/tu\n/vopros\n/offer'

KPB_TEXT = 'Это ключевые правила безопасности.\nСоблюдение этих правил позволит сохранить твоё здоровье.\nТрудись безопасно!'

HELP_TEXT = ' ты можешь не верить в себя, но знай и помни, что я верю в тебя. Я всегда верил и буду верить. У тебя всё получится!'

NS_TEXT = 'Это информация о несчастных случаях на производстве.'

QUIZ_TEXT = 'Ещё вопрос: /vopros\n\nПоказать все команды: /menu'

SERVICE_END_TEXT = (
    'Я получил обновление...\n\n'
    'Теперь можете прислать мне отзыв или предложение по моей работе. Просто наберите /offer'
    'А в остальном я всё тот же зануда. Всего хорошего!'
)

SERVICE_TEXT = 'Я отключусь пока, получаю обновление. Если к утру меня не будет, то вы знаете кто виноват.'
