MONTH_TEXT =[
    'Ну вот и очередной месяц наступил, а это значит, что пришло время познакомить вас с некоторыми планами.',
    'Новый месяц - новые свершения!',
    'Что там у нас по плану?',
]

PAT = {
    '8': 'Разрушение подогревателя газа ПТПГ-30 КЦ-5 без возгорания',
    '9': 'Утечка газа в укрытии ГПА КЦ-5 с возгоранием',
    '10': 'Разрыв газопровода топливного газа в БПТПГ КЦ-5 с возгоранием',
    '11': 'Разрыв трубок в секции маслоохладителей ГПА КЦ-6 с возгоранием',
    '12': 'Разрыв маслопровода ГПА КЦ-6 в отсеке двигаеля без возгорания',
}

TU = {
    '15.08.2022': [
        'Огневые работы на КС: определение, оформление, подготовительные работы, безопасность при проведении. Проведение целевого инструктажа для исполнителей',
        'Средства индивидуальной защиты и специальные средства СИЗОД, устройства и приспособления изолирующие. Стрховочные системы: назначение, конструкция, правила пользования, эксплуатационные испытания. Отработка практических навыков.',
    ],
    '19.09.2022': [
        'Обязанности персонала при работе КС. Состояния, в котором могет находиться остановленный ГПА.',
        'Меры безопасности при работе с электроинструментом. Эксплуатация системы частотного регулирования АВО масла ГПА.',
    ],
    '26.09.2022': [
        'Алгоритм пуска, нормального останова, аварийного останова, холодной прокрутки.',
        'Проведение повторного инструктажа для рабочих.',
        'Системы КИПиА КЦ-6. Принцип работы и порядок эксплуатации А-705-15 "Пилон-1".',
    ],
    '10.10.2022': [
        'Газоопасные работы на КС: определение, оформление, подготовка и проведение.',
        'Организация системы управления производственно-хозяйственной деятельности (СУПХД).',
    ],
    '24.10.2022': [
        'Требования ОТ при погрузочно-разгрузочных работах, работах на высоте.',
        'Охрана окружающей среды. Нарушение почвенного покрова и загрязнение почв. Загрязнения атмосферы в процессе произвоственно-хозяйственной деятельности и пути их уменьшения',
        'Оптимизация режимов работы КС и ГПА. Устройство и обслуживание регуляторов РДУ-80.',
    ],
    '07.11.2022': [
        'Действия при возникновении аварийной ситуации - "Разгерметизация пылеуловителя с возгоранием газа"',
        'Действия при возникновении аварийной ситуации - "Пожар на АВО газа в результате разгерметизации секции, трубопровода или арматуры"',
        'Действия при возникновении аварийной ситуации - "Разрыв газопровода (входного щлейфа) с возгоранием и без возгорания газа"',
    ],
    '21.11.2022': [
        'Оценка эффективности работы службы в области энергосбережения и повышения эффективности.',
        'Действия персонала при возникновении нештатных аварийных ситуаций с отработкой практических навыков, связанных со спуском и эвакуацией пострадавших из газовых колодцев.',
    ],
    '12.12.2022': [
        'Работы повышенной опасности, опасные и вредные производственные факторы.',
        'Риски на производстве.',
    ],
}
