WEATHER_MAIN = [
    'Я тут в "этих ваших интернетах" выяснил, что сейчас в посёлке',
    'Мне тут подсказывают, что сейчас в посёлке Лыхма',
    'Ах да, погода. Сейчас',
    'Что там за окном...',
    'Мой генератор случайной погоды говорит, что',
    'Вы, люди, когда не о чем говорить, говорите о погоде. Сейчас',
    'Шамана вызывали? Мой волшебный бубен утверждает, что',
    'Говорить не о чем, значит о погоде поговорим, вот прям сейчас',
    '"У природы нет плохой погоды. Каждая погода благодать." А у нас сегодня',
    'Я не хотел о погоде, но меня заставили. Сейчас',
]

WEATHER_HOT_PREFIX = [
    'Уххх...плавятся мои биты и байты.',
    '"Жара, жараааа. Жареное солнце больших городов".',
    'Скажу одно лишь слово "Пекло".',
    'В аду должно быть холоднее...',
    'ЖА-РА',
    'А мне вот не нравится жара...',
]

WEATHER_RAIN_PREFIX = [
    'Кап-кап-кап...',
    '"А грибной дождик - это мой!"',
    '"Капли на лице — это просто дождь, а может — плачу это я."',
    '"Ты слышишь, слышишь шаги, идет дождь…"',
    '"Дождик, мне никто не нужен. Я иду по лужам, мне никто не нужен…"',
    '"Любовь зарядила дожди-пистолеты..."',
    '"Мне не нравится дождь, он похож на тебя, так похож на тебя".\nЯ согласен с Олегом Газмановым - мне не нравится дождь.',
    '"А за окном серый дождь до утра, до утра. Барабанит по стеклам, сводит с ума."',
    '"Меня ты скоро позабудешь, художник, что рисует дождь. Другому ангелу ты служишь и за собой не позовешь" - ну попадись мне этот художник!',
    '"Подожди – дожди – дожди. Я оставил любовь позади."',
    '"Я прошу, вы привезите с собой дожди. С севера или какой – то другой земли." С севера, конечно с севера - забирай Марина Хлебникова.',
]

WEATHER_COLD_PREFIX = [
    'Мёрзни-мёрзни волчий хвост.',
    'Вот говорят, что для работы квантового компьютера необходимо охлаждение до абсолютного нуля. Напоминаю погоде - я не квантовый.',
    'Холод, прошу - перестань.',
    'А что, Скайнет уже захватил мир и настала ядерная зима? Нет? Тогда почему же так холодно?',
    '"Winter is already here" - сказал бы Эддард Старк.',
    'Валенок лишних не найдётся?',
    'Холод, хоть волков морозь',
    '"Голову держи в холоде, а ноги в тепле."\nМне нужно срочно отправить куда-нибудь мои виртуальные ноги.'
    'Бр-р-р-р, холод собачий.',
    '"А я ушаночку поглубже натяну"',
]
